NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Config/MemMap/Adc_MemMap.h
/******************************************************************************/
/* Copyright   :                                                              */
/* System Name : AUTOSAR MCAL                                                 */
/* File Name   : Adc_MemMap.h                                                 */
/* Version     : v1.00.00                                                     */
/* Contents    : Ecu Configuration(Ecuc)                                      */
/* Author      : --                                                           */
/* Note        : --                                                           */
/******************************************************************************/
/* Specification of LIN Driver                                                */
/* Release 4.0.3                                                              */

/* Suppress CC-RL Warnings (RL78/F1X) */
/*----------------------------------------------------------------------------*/
/* file version information                                                   */
/*----------------------------------------------------------------------------*/
#define ADC_70_VENDOR_ID_MEMMAP_H                       ( 70U )
#define ADC_70_MODULE_ID_MEMMAP_H                       ( 82U )

#define ADC_70_AR_RELEASE_MAJOR_VERSION_MEMMAP_H        ( 22U )
#define ADC_70_AR_RELEASE_MINOR_VERSION_MEMMAP_H        ( 11U )
#define ADC_70_AR_RELEASE_REVISION_VERSION_MEMMAP_H     ( 0U )

#define ADC_70_SW_MAJOR_VERSION_MEMMAP_H                ( 1U )
#define ADC_70_SW_MINOR_VERSION_MEMMAP_H                ( 0U )
#define ADC_70_SW_PATCH_VERSION_MEMMAP_H                ( 0U )

/*----------------------------------------------------------------------------*/
/* macro                                                                      */
/*----------------------------------------------------------------------------*/
#define MEMMAP_ERROR

#if 0
#elif defined( ADC_START_SEC_VAR_NO_INIT_LOCAL_8 )
    #undef ADC_START_SEC_VAR_NO_INIT_LOCAL_8
    #define START_SECTION_BSS_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_NO_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_NO_INIT_LOCAL_8
    #define STOP_SECTION_BSS_LOCAL_8
#elif defined( ADC_START_SEC_VAR_NO_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_NO_INIT_LOCAL_16
    #define START_SECTION_BSS_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_NO_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_NO_INIT_LOCAL_16
    #define STOP_SECTION_BSS_LOCAL_16
#elif defined( ADC_START_SEC_VAR_NO_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_NO_INIT_LOCAL_32
    #define START_SECTION_BSS_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_NO_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_NO_INIT_LOCAL_32
    #define STOP_SECTION_BSS_LOCAL_32
#elif defined( ADC_START_SEC_VAR_NO_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_NO_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_NO_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_NO_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_NO_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_NO_INIT_GLOBAL_8
    #define START_SECTION_BSS_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_NO_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_NO_INIT_GLOBAL_8
    #define STOP_SECTION_BSS_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_NO_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_NO_INIT_GLOBAL_16
    #define START_SECTION_BSS_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_NO_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_NO_INIT_GLOBAL_16
    #define STOP_SECTION_BSS_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_NO_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_NO_INIT_GLOBAL_32
    #define START_SECTION_BSS_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_NO_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_NO_INIT_GLOBAL_32
    #define STOP_SECTION_BSS_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_NO_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_NO_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_NO_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_NO_INIT_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_CLEARED_LOCAL_8 )
    #undef ADC_START_SEC_VAR_CLEARED_LOCAL_8
    #define START_SECTION_BSS0_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_CLEARED_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_CLEARED_LOCAL_8
    #define STOP_SECTION_BSS0_LOCAL_8
#elif defined( ADC_START_SEC_VAR_CLEARED_LOCAL_16 )
    #undef ADC_START_SEC_VAR_CLEARED_LOCAL_16
    #define START_SECTION_BSS0_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_CLEARED_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_CLEARED_LOCAL_16
    #define STOP_SECTION_BSS0_LOCAL_16
#elif defined( ADC_START_SEC_VAR_CLEARED_LOCAL_32 )
    #undef ADC_START_SEC_VAR_CLEARED_LOCAL_32
    #define START_SECTION_BSS0_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_CLEARED_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_CLEARED_LOCAL_32
    #define STOP_SECTION_BSS0_LOCAL_32
#elif defined( ADC_START_SEC_VAR_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_CLEARED_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS0_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_CLEARED_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS0_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_CLEARED_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_CLEARED_GLOBAL_8
    #define START_SECTION_BSS0_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_CLEARED_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_CLEARED_GLOBAL_8
    #define STOP_SECTION_BSS0_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_CLEARED_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_CLEARED_GLOBAL_16
    #define START_SECTION_BSS0_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_CLEARED_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_CLEARED_GLOBAL_16
    #define STOP_SECTION_BSS0_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_CLEARED_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_CLEARED_GLOBAL_32
    #define START_SECTION_BSS0_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_CLEARED_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_CLEARED_GLOBAL_32
    #define STOP_SECTION_BSS0_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_CLEARED_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS0_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_CLEARED_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS0_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_POWER_ON_CLEARED_LOCAL_8 )
    #undef ADC_START_SEC_VAR_POWER_ON_CLEARED_LOCAL_8
    #define START_SECTION_BSS0P_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_CLEARED_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_CLEARED_LOCAL_8
    #define STOP_SECTION_BSS0P_LOCAL_8
#elif defined( ADC_START_SEC_VAR_POWER_ON_CLEARED_LOCAL_16 )
    #undef ADC_START_SEC_VAR_POWER_ON_CLEARED_LOCAL_16
    #define START_SECTION_BSS0P_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_CLEARED_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_CLEARED_LOCAL_16
    #define STOP_SECTION_BSS0P_LOCAL_16
#elif defined( ADC_START_SEC_VAR_POWER_ON_CLEARED_LOCAL_32 )
    #undef ADC_START_SEC_VAR_POWER_ON_CLEARED_LOCAL_32
    #define START_SECTION_BSS0P_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_CLEARED_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_CLEARED_LOCAL_32
    #define STOP_SECTION_BSS0P_LOCAL_32
#elif defined( ADC_START_SEC_VAR_POWER_ON_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_POWER_ON_CLEARED_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS0P_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_POWER_ON_CLEARED_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS0P_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_POWER_ON_CLEARED_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_POWER_ON_CLEARED_GLOBAL_8
    #define START_SECTION_BSS0P_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_CLEARED_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_CLEARED_GLOBAL_8
    #define STOP_SECTION_BSS0P_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_POWER_ON_CLEARED_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_POWER_ON_CLEARED_GLOBAL_16
    #define START_SECTION_BSS0P_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_CLEARED_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_CLEARED_GLOBAL_16
    #define STOP_SECTION_BSS0P_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_POWER_ON_CLEARED_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_POWER_ON_CLEARED_GLOBAL_32
    #define START_SECTION_BSS0P_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_CLEARED_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_CLEARED_GLOBAL_32
    #define STOP_SECTION_BSS0P_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS0P_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS0P_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_INIT_LOCAL_8 )
    #undef ADC_START_SEC_VAR_INIT_LOCAL_8
    #define START_SECTION_DATA_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_INIT_LOCAL_8
    #define STOP_SECTION_DATA_LOCAL_8
#elif defined( ADC_START_SEC_VAR_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_INIT_LOCAL_16
    #define START_SECTION_DATA_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_INIT_LOCAL_16
    #define STOP_SECTION_DATA_LOCAL_16
#elif defined( ADC_START_SEC_VAR_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_INIT_LOCAL_32
    #define START_SECTION_DATA_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_INIT_LOCAL_32
    #define STOP_SECTION_DATA_LOCAL_32
#elif defined( ADC_START_SEC_VAR_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_DATA_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_DATA_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_INIT_GLOBAL_8
    #define START_SECTION_DATA_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_INIT_GLOBAL_8
    #define STOP_SECTION_DATA_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_INIT_GLOBAL_16
    #define START_SECTION_DATA_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_INIT_GLOBAL_16
    #define STOP_SECTION_DATA_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_INIT_GLOBAL_32
    #define START_SECTION_DATA_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_INIT_GLOBAL_32
    #define STOP_SECTION_DATA_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_DATA_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_INIT_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_DATA_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_POWER_ON_INIT_LOCAL_8 )
    #undef ADC_START_SEC_VAR_POWER_ON_INIT_LOCAL_8
    #define START_SECTION_DATAP_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_INIT_LOCAL_8
    #define STOP_SECTION_DATAP_LOCAL_8
#elif defined( ADC_START_SEC_VAR_POWER_ON_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_POWER_ON_INIT_LOCAL_16
    #define START_SECTION_DATAP_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_INIT_LOCAL_16
    #define STOP_SECTION_DATAP_LOCAL_16
#elif defined( ADC_START_SEC_VAR_POWER_ON_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_POWER_ON_INIT_LOCAL_32
    #define START_SECTION_DATAP_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_INIT_LOCAL_32
    #define STOP_SECTION_DATAP_LOCAL_32
#elif defined( ADC_START_SEC_VAR_POWER_ON_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_POWER_ON_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_DATAP_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_POWER_ON_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_DATAP_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_POWER_ON_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_POWER_ON_INIT_GLOBAL_8
    #define START_SECTION_DATAP_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_INIT_GLOBAL_8
    #define STOP_SECTION_DATAP_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_POWER_ON_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_POWER_ON_INIT_GLOBAL_16
    #define START_SECTION_DATAP_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_INIT_GLOBAL_16
    #define STOP_SECTION_DATAP_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_POWER_ON_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_POWER_ON_INIT_GLOBAL_32
    #define START_SECTION_DATAP_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_POWER_ON_INIT_GLOBAL_32
    #define STOP_SECTION_DATAP_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_POWER_ON_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_POWER_ON_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_DATAP_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_POWER_ON_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_POWER_ON_INIT_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_DATAP_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_NO_INIT_LOCAL_8 )
    #undef ADC_START_SEC_VAR_FAST_NO_INIT_LOCAL_8
    #define START_SECTION_BSS_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_NO_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_NO_INIT_LOCAL_8
    #define STOP_SECTION_BSS_LOCAL_8
#elif defined( ADC_START_SEC_VAR_FAST_NO_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_FAST_NO_INIT_LOCAL_16
    #define START_SECTION_BSS_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_NO_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_NO_INIT_LOCAL_16
    #define STOP_SECTION_BSS_LOCAL_16
#elif defined( ADC_START_SEC_VAR_FAST_NO_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_FAST_NO_INIT_LOCAL_32
    #define START_SECTION_BSS_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_NO_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_NO_INIT_LOCAL_32
    #define STOP_SECTION_BSS_LOCAL_32
#elif defined( ADC_START_SEC_VAR_FAST_NO_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_NO_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_NO_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_NO_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_NO_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_FAST_NO_INIT_GLOBAL_8
    #define START_SECTION_BSS_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_NO_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_NO_INIT_GLOBAL_8
    #define STOP_SECTION_BSS_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_FAST_NO_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_FAST_NO_INIT_GLOBAL_16
    #define START_SECTION_BSS_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_NO_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_NO_INIT_GLOBAL_16
    #define STOP_SECTION_BSS_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_FAST_NO_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_FAST_NO_INIT_GLOBAL_32
    #define START_SECTION_BSS_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_NO_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_NO_INIT_GLOBAL_32
    #define STOP_SECTION_BSS_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_FAST_NO_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_NO_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_NO_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_NO_INIT_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_CLEARED_LOCAL_8 )
    #undef ADC_START_SEC_VAR_FAST_CLEARED_LOCAL_8
    #define START_SECTION_BSS0_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_CLEARED_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_CLEARED_LOCAL_8
    #define STOP_SECTION_BSS0_LOCAL_8
#elif defined( ADC_START_SEC_VAR_FAST_CLEARED_LOCAL_16 )
    #undef ADC_START_SEC_VAR_FAST_CLEARED_LOCAL_16
    #define START_SECTION_BSS0_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_CLEARED_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_CLEARED_LOCAL_16
    #define STOP_SECTION_BSS0_LOCAL_16
#elif defined( ADC_START_SEC_VAR_FAST_CLEARED_LOCAL_32 )
    #undef ADC_START_SEC_VAR_FAST_CLEARED_LOCAL_32
    #define START_SECTION_BSS0_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_CLEARED_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_CLEARED_LOCAL_32
    #define STOP_SECTION_BSS0_LOCAL_32
#elif defined( ADC_START_SEC_VAR_FAST_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_CLEARED_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS0_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_CLEARED_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS0_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_CLEARED_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_FAST_CLEARED_GLOBAL_8
    #define START_SECTION_BSS0_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_CLEARED_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_CLEARED_GLOBAL_8
    #define STOP_SECTION_BSS0_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_FAST_CLEARED_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_FAST_CLEARED_GLOBAL_16
    #define START_SECTION_BSS0_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_CLEARED_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_CLEARED_GLOBAL_16
    #define STOP_SECTION_BSS0_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_FAST_CLEARED_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_FAST_CLEARED_GLOBAL_32
    #define START_SECTION_BSS0_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_CLEARED_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_CLEARED_GLOBAL_32
    #define STOP_SECTION_BSS0_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_FAST_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_CLEARED_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS0_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_CLEARED_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS0_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_8 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_8
    #define START_SECTION_BSS0P_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_8
    #define STOP_SECTION_BSS0P_LOCAL_8
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_16 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_16
    #define START_SECTION_BSS0P_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_16
    #define STOP_SECTION_BSS0P_LOCAL_16
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_32 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_32
    #define START_SECTION_BSS0P_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_32
    #define STOP_SECTION_BSS0P_LOCAL_32
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS0P_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS0P_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_8
    #define START_SECTION_BSS0P_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_8
    #define STOP_SECTION_BSS0P_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_16
    #define START_SECTION_BSS0P_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_16
    #define STOP_SECTION_BSS0P_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_32
    #define START_SECTION_BSS0P_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_32
    #define STOP_SECTION_BSS0P_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS0P_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS0P_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_INIT_LOCAL_8 )
    #undef ADC_START_SEC_VAR_FAST_INIT_LOCAL_8
    #define START_SECTION_DATA_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_INIT_LOCAL_8
    #define STOP_SECTION_DATA_LOCAL_8
#elif defined( ADC_START_SEC_VAR_FAST_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_FAST_INIT_LOCAL_16
    #define START_SECTION_DATA_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_INIT_LOCAL_16
    #define STOP_SECTION_DATA_LOCAL_16
#elif defined( ADC_START_SEC_VAR_FAST_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_FAST_INIT_LOCAL_32
    #define START_SECTION_DATA_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_INIT_LOCAL_32
    #define STOP_SECTION_DATA_LOCAL_32
#elif defined( ADC_START_SEC_VAR_FAST_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_DATA_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_DATA_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_FAST_INIT_GLOBAL_8
    #define START_SECTION_DATA_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_INIT_GLOBAL_8
    #define STOP_SECTION_DATA_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_FAST_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_FAST_INIT_GLOBAL_16
    #define START_SECTION_DATA_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_INIT_GLOBAL_16
    #define STOP_SECTION_DATA_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_FAST_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_FAST_INIT_GLOBAL_32
    #define START_SECTION_DATA_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_INIT_GLOBAL_32
    #define STOP_SECTION_DATA_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_FAST_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_DATA_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_INIT_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_DATA_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_8 )
