NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Config/MemMap/Adc_MemMap.h
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_8
    #define START_SECTION_DATAP_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_8
    #define STOP_SECTION_DATAP_LOCAL_8
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_16
    #define START_SECTION_DATAP_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_16
    #define STOP_SECTION_DATAP_LOCAL_16
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_32
    #define START_SECTION_DATAP_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_32
    #define STOP_SECTION_DATAP_LOCAL_32
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_DATAP_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_DATAP_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_8
    #define START_SECTION_DATAP_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_8
    #define STOP_SECTION_DATAP_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_16
    #define START_SECTION_DATAP_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_16
    #define STOP_SECTION_DATAP_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_32
    #define START_SECTION_DATAP_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_32
    #define STOP_SECTION_DATAP_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_DATAP_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_FAST_POWER_ON_INIT_GLOBAL_UNSPECIFIED
 
    #define STOP_SECTION_DATAP_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_NO_INIT_LOCAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_NO_INIT_LOCAL_8
    #define START_SECTION_BSS_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_NO_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_NO_INIT_LOCAL_8
    #define STOP_SECTION_BSS_LOCAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_NO_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_NO_INIT_LOCAL_16
    #define START_SECTION_BSS_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_NO_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_NO_INIT_LOCAL_16
    #define STOP_SECTION_BSS_LOCAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_NO_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_NO_INIT_LOCAL_32
    #define START_SECTION_BSS_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_NO_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_NO_INIT_LOCAL_32
    #define STOP_SECTION_BSS_LOCAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_NO_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_NO_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_NO_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_NO_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_NO_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_NO_INIT_GLOBAL_8
    #define START_SECTION_BSS_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_NO_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_NO_INIT_GLOBAL_8
    #define STOP_SECTION_BSS_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_NO_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_NO_INIT_GLOBAL_16
    #define START_SECTION_BSS_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_NO_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_NO_INIT_GLOBAL_16
    #define STOP_SECTION_BSS_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_NO_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_NO_INIT_GLOBAL_32
    #define START_SECTION_BSS_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_NO_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_NO_INIT_GLOBAL_32
    #define STOP_SECTION_BSS_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_NO_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_NO_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_NO_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_NO_INIT_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_CLEARED_LOCAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_CLEARED_LOCAL_8
    #define START_SECTION_BSS0_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_CLEARED_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_CLEARED_LOCAL_8
    #define STOP_SECTION_BSS0_LOCAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_CLEARED_LOCAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_CLEARED_LOCAL_16
    #define START_SECTION_BSS0_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_CLEARED_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_CLEARED_LOCAL_16
    #define STOP_SECTION_BSS0_LOCAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_CLEARED_LOCAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_CLEARED_LOCAL_32
    #define START_SECTION_BSS0_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_CLEARED_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_CLEARED_LOCAL_32
    #define STOP_SECTION_BSS0_LOCAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_CLEARED_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS0_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_CLEARED_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS0_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_CLEARED_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_CLEARED_GLOBAL_8
    #define START_SECTION_BSS0_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_CLEARED_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_CLEARED_GLOBAL_8
    #define STOP_SECTION_BSS0_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_CLEARED_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_CLEARED_GLOBAL_16
    #define START_SECTION_BSS0_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_CLEARED_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_CLEARED_GLOBAL_16
    #define STOP_SECTION_BSS0_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_CLEARED_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_CLEARED_GLOBAL_32
    #define START_SECTION_BSS0_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_CLEARED_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_CLEARED_GLOBAL_32
    #define STOP_SECTION_BSS0_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_CLEARED_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS0_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_CLEARED_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS0_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_8
    #define START_SECTION_BSS0P_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_8
    #define STOP_SECTION_BSS0P_LOCAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_16
    #define START_SECTION_BSS0P_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_16
    #define STOP_SECTION_BSS0P_LOCAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_32
    #define START_SECTION_BSS0P_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_32
    #define STOP_SECTION_BSS0P_LOCAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_UNSPECIFIED
    #define START_SECTION_BSS0P_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_LOCAL_UNSPECIFIED
    #define STOP_SECTION_BSS0P_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_8
    #define START_SECTION_BSS0P_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_8
    #define STOP_SECTION_BSS0P_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_16
    #define START_SECTION_BSS0P_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_16
    #define STOP_SECTION_BSS0P_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_32
    #define START_SECTION_BSS0P_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_32
    #define STOP_SECTION_BSS0P_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED
    #define START_SECTION_BSS0P_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_CLEARED_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_BSS0P_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_INIT_LOCAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_INIT_LOCAL_8
    #define START_SECTION_DATA_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_INIT_LOCAL_8
    #define STOP_SECTION_DATA_LOCAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_INIT_LOCAL_16
    #define START_SECTION_DATA_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_INIT_LOCAL_16
    #define STOP_SECTION_DATA_LOCAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_INIT_LOCAL_32
    #define START_SECTION_DATA_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_INIT_LOCAL_32
    #define STOP_SECTION_DATA_LOCAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_DATA_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_DATA_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_INIT_GLOBAL_8
    #define START_SECTION_DATA_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_INIT_GLOBAL_8
    #define STOP_SECTION_DATA_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_INIT_GLOBAL_16
    #define START_SECTION_DATA_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_INIT_GLOBAL_16
    #define STOP_SECTION_DATA_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_INIT_GLOBAL_32
    #define START_SECTION_DATA_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_INIT_GLOBAL_32
    #define STOP_SECTION_DATA_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_DATA_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_INIT_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_DATA_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_8
    #define START_SECTION_DATAP_LOCAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_8
    #define STOP_SECTION_DATAP_LOCAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_16
    #define START_SECTION_DATAP_LOCAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_16
    #define STOP_SECTION_DATAP_LOCAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_32
    #define START_SECTION_DATAP_LOCAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_32
    #define STOP_SECTION_DATAP_LOCAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_UNSPECIFIED
    #define START_SECTION_DATAP_LOCAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_LOCAL_UNSPECIFIED
    #define STOP_SECTION_DATAP_LOCAL_UNSPECIFIED
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_8 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_8
    #define START_SECTION_DATAP_GLOBAL_8
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_8 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_8
    #define STOP_SECTION_DATAP_GLOBAL_8
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_16 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_16
    #define START_SECTION_DATAP_GLOBAL_16
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_16 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_16
    #define STOP_SECTION_DATAP_GLOBAL_16
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_32 )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_32
    #define START_SECTION_DATAP_GLOBAL_32
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_32 )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_32
    #define STOP_SECTION_DATAP_GLOBAL_32
#elif defined( ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_START_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_UNSPECIFIED
    #define START_SECTION_DATAP_GLOBAL_UNSPECIFIED
#elif defined( ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_UNSPECIFIED )
    #undef ADC_STOP_SEC_VAR_SLOW_POWER_ON_INIT_GLOBAL_UNSPECIFIED
    #define STOP_SECTION_DATAP_GLOBAL_UNSPECIFIED
#elif defined( ADC_START_SEC_CONST_8 )
    #undef ADC_START_SEC_CONST_8
    #define START_SECTION_RODATA_8
#elif defined( ADC_STOP_SEC_CONST_8 )
    #undef ADC_STOP_SEC_CONST_8
    #define STOP_SECTION_RODATA_8
#elif defined( ADC_START_SEC_CONST_16 )
    #undef ADC_START_SEC_CONST_16
    #define START_SECTION_RODATA_16
#elif defined( ADC_STOP_SEC_CONST_16 )
    #undef ADC_STOP_SEC_CONST_16
    #define STOP_SECTION_RODATA_16
#elif defined( ADC_START_SEC_CONST_32 )
    #undef ADC_START_SEC_CONST_32
    #define START_SECTION_RODATA_32
#elif defined( ADC_STOP_SEC_CONST_32 )
    #undef ADC_STOP_SEC_CONST_32
    #define STOP_SECTION_RODATA_32
#elif defined( ADC_START_SEC_CONST_UNSPECIFIED )
    #undef ADC_START_SEC_CONST_UNSPECIFIED
    #define START_SECTION_RODATA_UNSPECIFIED
#elif defined( ADC_STOP_SEC_CONST_UNSPECIFIED )
    #undef ADC_STOP_SEC_CONST_UNSPECIFIED
    #define STOP_SECTION_RODATA_UNSPECIFIED
#elif defined( ADC_START_SEC_CONFIG_DATA_8 )
    #undef ADC_START_SEC_CONFIG_DATA_8
    #define START_SECTION_CONFIG_8
#elif defined( ADC_STOP_SEC_CONFIG_DATA_8 )
    #undef ADC_STOP_SEC_CONFIG_DATA_8
    #define STOP_SECTION_CONFIG_8
#elif defined( ADC_START_SEC_CONFIG_DATA_16 )
    #undef ADC_START_SEC_CONFIG_DATA_16
    #define START_SECTION_CONFIG_16
#elif defined( ADC_STOP_SEC_CONFIG_DATA_16 )
    #undef ADC_STOP_SEC_CONFIG_DATA_16
    #define STOP_SECTION_CONFIG_16
#elif defined( ADC_START_SEC_CONFIG_DATA_32 )
    #undef ADC_START_SEC_CONFIG_DATA_32
    #define START_SECTION_CONFIG_32
#elif defined( ADC_STOP_SEC_CONFIG_DATA_32 )
    #undef ADC_STOP_SEC_CONFIG_DATA_32
    #define STOP_SECTION_CONFIG_32
#elif defined( ADC_START_SEC_CONFIG_DATA_UNSPECIFIED )
    #undef ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    #define START_SECTION_CONFIG_UNSPECIFIED
#elif defined( ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED )
    #undef ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
    #define STOP_SECTION_CONFIG_UNSPECIFIED
#elif defined( ADC_START_SEC_CODE_LOCAL )
    #undef ADC_START_SEC_CODE_LOCAL
    #define START_SECTION_TEXT_LOCAL
#elif defined( ADC_STOP_SEC_CODE_LOCAL )
    #undef ADC_STOP_SEC_CODE_LOCAL
    #define STOP_SECTION_TEXT_LOCAL
#elif defined( ADC_START_SEC_CODE_GLOBAL )
    #undef ADC_START_SEC_CODE_GLOBAL
    #define START_SECTION_TEXT_GLOBAL
#elif defined( ADC_STOP_SEC_CODE_GLOBAL )
    #undef ADC_STOP_SEC_CODE_GLOBAL
    #define STOP_SECTION_TEXT_GLOBAL
#elif defined( ADC_START_SEC_CODE_FAST_LOCAL )
    #undef ADC_START_SEC_CODE_FAST_LOCAL
    #define START_SECTION_TEXT_LOCAL
#elif defined( ADC_STOP_SEC_CODE_FAST_LOCAL )
    #undef ADC_STOP_SEC_CODE_FAST_LOCAL
    #define STOP_SECTION_TEXT_LOCAL
#elif defined( ADC_START_SEC_CODE_FAST_GLOBAL )
    #undef ADC_START_SEC_CODE_FAST_GLOBAL
    #define START_SECTION_TEXT_GLOBAL
#elif defined( ADC_STOP_SEC_CODE_FAST_GLOBAL )
    #undef ADC_STOP_SEC_CODE_FAST_GLOBAL
    #define STOP_SECTION_TEXT_GLOBAL
#elif defined( ADC_START_SEC_CODE_SLOW_LOCAL )
    #undef ADC_START_SEC_CODE_SLOW_LOCAL
    #define START_SECTION_TEXT_LOCAL
#elif defined( ADC_STOP_SEC_CODE_SLOW_LOCAL )
    #undef ADC_STOP_SEC_CODE_SLOW_LOCAL
    #define STOP_SECTION_TEXT_LOCAL
#elif defined( ADC_START_SEC_CODE_SLOW_GLOBAL )
    #undef ADC_START_SEC_CODE_SLOW_GLOBAL
    #define START_SECTION_TEXT_GLOBAL
#elif defined( ADC_STOP_SEC_CODE_SLOW_GLOBAL )
    #undef ADC_STOP_SEC_CODE_SLOW_GLOBAL
    #define STOP_SECTION_TEXT_GLOBAL
#elif defined( ADC_START_SEC_VAR_SAVED_ZONE0_32 )
    #undef ADC_START_SEC_VAR_SAVED_ZONE0_32
    #define START_SECTION_BSS_ZONE0_32
#elif defined( ADC_STOP_SEC_VAR_SAVED_ZONE0_32 )
    #undef ADC_STOP_SEC_VAR_SAVED_ZONE0_32
    #define STOP_SECTION_BSS_ZONE0_32
#elif defined( ADC_START_SEC_VAR_SAVED_ZONE1_32 )
    #undef ADC_START_SEC_VAR_SAVED_ZONE1_32
    #define START_SECTION_BSS_ZONE1_32
#elif defined( ADC_STOP_SEC_VAR_SAVED_ZONE1_32 )
    #undef ADC_STOP_SEC_VAR_SAVED_ZONE1_32
    #define STOP_SECTION_BSS_ZONE1_32
#elif defined( ADC_START_SEC_VAR_SAVED_ZONE2_32 )
    #undef ADC_START_SEC_VAR_SAVED_ZONE2_32
    #define START_SECTION_BSS_ZONE2_32
#elif defined( ADC_STOP_SEC_VAR_SAVED_ZONE2_32 )
    #undef ADC_STOP_SEC_VAR_SAVED_ZONE2_32
    #define STOP_SECTION_BSS_ZONE2_32
#elif defined( ADC_START_SEC_VAR_SAVED_ZONE3_32 )
    #undef ADC_START_SEC_VAR_SAVED_ZONE3_32
    #define START_SECTION_BSS_ZONE3_32
#elif defined( ADC_STOP_SEC_VAR_SAVED_ZONE3_32 )
    #undef ADC_STOP_SEC_VAR_SAVED_ZONE3_32
    #define STOP_SECTION_BSS_ZONE3_32
#elif defined( ADC_START_SEC_VAR_SAVED_ZONE4_32 )
    #undef ADC_START_SEC_VAR_SAVED_ZONE4_32
    #define START_SECTION_BSS_ZONE4_32
#elif defined( ADC_STOP_SEC_VAR_SAVED_ZONE4_32 )
    #undef ADC_STOP_SEC_VAR_SAVED_ZONE4_32
    #define STOP_SECTION_BSS_ZONE4_32
#elif defined( ADC_START_SEC_VAR_SAVED_ZONE5_32 )
    #undef ADC_START_SEC_VAR_SAVED_ZONE5_32
    #define START_SECTION_BSS_ZONE5_32
#elif defined( ADC_STOP_SEC_VAR_SAVED_ZONE5_32 )
    #undef ADC_STOP_SEC_VAR_SAVED_ZONE5_32
    #define STOP_SECTION_BSS_ZONE5_32
#elif defined( ADC_START_SEC_VAR_SAVED_ZONE6_32 )
    #undef ADC_START_SEC_VAR_SAVED_ZONE6_32
    #define START_SECTION_BSS_ZONE6_32
#elif defined( ADC_STOP_SEC_VAR_SAVED_ZONE6_32 )
    #undef ADC_STOP_SEC_VAR_SAVED_ZONE6_32
    #define STOP_SECTION_BSS_ZONE6_32
#elif defined( ADC_START_SEC_VAR_SAVED_ZONE7_32 )
    #undef ADC_START_SEC_VAR_SAVED_ZONE7_32
    #define START_SECTION_BSS_ZONE7_32
#elif defined( ADC_STOP_SEC_VAR_SAVED_ZONE7_32 )
    #undef ADC_STOP_SEC_VAR_SAVED_ZONE7_32
    #define STOP_SECTION_BSS_ZONE7_32
#elif defined( ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE0_32 )
    #undef ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE0_32
    #define START_SECTION_RODATA_ZONE0_32
#elif defined( ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE0_32 )
    #undef ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE0_32
    #define STOP_SECTION_RODATA_ZONE0_32
#elif defined( ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE1_32 )
    #undef ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE1_32
    #define START_SECTION_RODATA_ZONE1_32
#elif defined( ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE1_32 )
    #undef ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE1_32
    #define STOP_SECTION_RODATA_ZONE1_32
#elif defined( ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE2_32 )
    #undef ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE2_32
    #define START_SECTION_RODATA_ZONE2_32
#elif defined( ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE2_32 )
    #undef ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE2_32
    #define STOP_SECTION_RODATA_ZONE2_32
#elif defined( ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE3_32 )
    #undef ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE3_32
    #define START_SECTION_RODATA_ZONE3_32
#elif defined( ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE3_32 )
    #undef ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE3_32
    #define STOP_SECTION_RODATA_ZONE3_32
#elif defined( ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE4_32 )
    #undef ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE4_32
    #define START_SECTION_RODATA_ZONE4_32
#elif defined( ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE4_32 )
    #undef ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE4_32
    #define STOP_SECTION_RODATA_ZONE4_32
#elif defined( ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE5_32 )
    #undef ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE5_32
    #define START_SECTION_RODATA_ZONE5_32
#elif defined( ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE5_32 )
    #undef ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE5_32
    #define STOP_SECTION_RODATA_ZONE5_32
#elif defined( ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE6_32 )
    #undef ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE6_32
    #define START_SECTION_RODATA_ZONE6_32
#elif defined( ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE6_32 )
    #undef ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE6_32
    #define STOP_SECTION_RODATA_ZONE6_32
#elif defined( ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE7_32 )
    #undef ADC_START_SEC_CONST_SAVED_RECOVERY_ZONE7_32
    #define START_SECTION_RODATA_ZONE7_32
#elif defined( ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE7_32 )
    #undef ADC_STOP_SEC_CONST_SAVED_RECOVERY_ZONE7_32
    #define STOP_SECTION_RODATA_ZONE7_32
#endif
#if 0
#elif defined( START_SECTION_BSS_LOCAL_8 )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_LOCAL_8 )
    #pragma section
    #undef STOP_SECTION_BSS_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_LOCAL_16 )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_LOCAL_16 )
    #pragma section
    #undef STOP_SECTION_BSS_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_LOCAL_32 )
    #pragma section bss .qines_mcal_adc_bss
