NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Config/MemMap/Adc_MemMap.h
    #undef START_SECTION_BSS_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_LOCAL_32 )
    #pragma section
    #undef STOP_SECTION_BSS_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_LOCAL_UNSPECIFIED )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_LOCAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_BSS_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_GLOBAL_8 )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_GLOBAL_8 )
    #pragma section
    #undef STOP_SECTION_BSS_GLOBAL_8
#elif defined( START_SECTION_BSS_GLOBAL_16 )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_GLOBAL_16 )
    #pragma section
    #undef STOP_SECTION_BSS_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_GLOBAL_32 )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_GLOBAL_32 )
    #pragma section
    #undef STOP_SECTION_BSS_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_GLOBAL_UNSPECIFIED )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_GLOBAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_BSS_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0_LOCAL_8 )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS0_LOCAL_8
    #undef MEMMAP_ERROR
 
#elif defined( STOP_SECTION_BSS0_LOCAL_8 )
    #pragma section
    #undef STOP_SECTION_BSS0_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0_LOCAL_16 )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS0_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0_LOCAL_16 )
    #pragma section
    #undef STOP_SECTION_BSS0_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0_LOCAL_32 )
    #pragma section bss .qines_mcal_adc_bss
    #undef START_SECTION_BSS0_LOCAL_32
    #undef ERROR
#elif defined( STOP_SECTION_BSS0_LOCAL_32 )
    #pragma section
    #undef STOP_SECTION_BSS0_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0_LOCAL_UNSPECIFIED )
    #pragma section bss .qines_mcal_adc_bss0_local
    #undef START_SECTION_BSS0_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0_LOCAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_BSS0_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0_GLOBAL_8 )
    #pragma section bss .qines_mcal_adc_bss0
    #undef START_SECTION_BSS0_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0_GLOBAL_8 )
    #pragma section
    #undef STOP_SECTION_BSS0_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0_GLOBAL_16 )
    #pragma section bss .qines_mcal_adc_bss0
    #undef START_SECTION_BSS0_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0_GLOBAL_16 )
    #pragma section
    #undef STOP_SECTION_BSS0_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0_GLOBAL_32 )
    #pragma section bss .qines_mcal_adc_bss0
    #undef START_SECTION_BSS0_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0_GLOBAL_32 )
    #pragma section
    #undef STOP_SECTION_BSS0_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0_GLOBAL_UNSPECIFIED )
    #pragma section bss .qines_mcal_adc_bss0
    #undef START_SECTION_BSS0_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0_GLOBAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_BSS0_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0P_LOCAL_8 )
    #pragma section bss .qines_mcal_adc_bss0p
    #undef START_SECTION_BSS0P_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0P_LOCAL_8 )
    #pragma section
    #undef STOP_SECTION_BSS0P_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0P_LOCAL_16 )
    #pragma section bss .qines_mcal_adc_bss0p
    #undef START_SECTION_BSS0P_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0P_LOCAL_16 )
    #pragma section
    #undef STOP_SECTION_BSS0P_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0P_LOCAL_32 )
    #pragma section bss .qines_mcal_adc_bss0p
    #undef START_SECTION_BSS0P_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0P_LOCAL_32 )
    #pragma section
    #undef STOP_SECTION_BSS0P_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0P_LOCAL_UNSPECIFIED )
    #pragma section bss .qines_mcal_adc_bss0p
    #undef START_SECTION_BSS0P_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0P_LOCAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_BSS0P_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0P_GLOBAL_8 )
    #pragma section bss .qines_mcal_adc_bss0p
    #undef START_SECTION_BSS0P_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0P_GLOBAL_8 )
    #pragma section
    #undef STOP_SECTION_BSS0P_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0P_GLOBAL_16 )
    #pragma section bss .qines_mcal_adc_bss0p
    #pragma alignvar (2)
    #undef START_SECTION_BSS0P_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0P_GLOBAL_16 )
    #pragma sectiont
    #undef STOP_SECTION_BSS0P_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0P_GLOBAL_32 )
    #pragma section bss .qines_mcal_adc_bss0p
    #undef START_SECTION_BSS0P_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0P_GLOBAL_32 )
    #pragma section
    #undef STOP_SECTION_BSS0P_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS0P_GLOBAL_UNSPECIFIED )
    #pragma section bss .qines_mcal_adc_bss0p
    #undef START_SECTION_BSS0P_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS0P_GLOBAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_BSS0P_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATA_LOCAL_8 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATA_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATA_LOCAL_8 )
    #pragma section
    #undef STOP_SECTION_DATA_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATA_LOCAL_16 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATA_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATA_LOCAL_16 )
    #pragma section
    #pragma alignvar (4)
    #undef STOP_SECTION_DATA_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATA_LOCAL_32 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATA_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATA_LOCAL_32 )
    #pragma section
    #undef STOP_SECTION_DATA_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATA_LOCAL_UNSPECIFIED )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATA_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATA_LOCAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_DATA_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATA_GLOBAL_8 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATA_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATA_GLOBAL_8 )
    #pragma section
    #pragma alignvar (4)
    #undef STOP_SECTION_DATA_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATA_GLOBAL_16 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATA_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATA_GLOBAL_16 )
    #pragma section
    #undef STOP_SECTION_DATA_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATA_GLOBAL_32 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATA_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATA_GLOBAL_32 )
    #pragma section
    #undef STOP_SECTION_DATA_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATA_GLOBAL_UNSPECIFIED )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATA_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATA_GLOBAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_DATA_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATAP_LOCAL_8 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATAP_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATAP_LOCAL_8 )
    #pragma section
    #undef STOP_SECTION_DATAP_LOCAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATAP_LOCAL_16 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATAP_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATAP_LOCAL_16 )
    #pragma section
    #undef STOP_SECTION_DATAP_LOCAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATAP_LOCAL_32 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATAP_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATAP_LOCAL_32 )
    #pragma section
    #undef STOP_SECTION_DATAP_LOCAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATAP_LOCAL_UNSPECIFIED )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATAP_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATAP_LOCAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_DATAP_LOCAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATAP_GLOBAL_8 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATAP_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATAP_GLOBAL_8 )
    #pragma section
    #undef STOP_SECTION_DATAP_GLOBAL_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATAP_GLOBAL_16 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATAP_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATAP_GLOBAL_16 )
    #pragma section
    #undef STOP_SECTION_DATAP_GLOBAL_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATAP_GLOBAL_32 )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATAP_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATAP_GLOBAL_32 )
    #pragma section
    #undef STOP_SECTION_DATAP_GLOBAL_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_DATAP_GLOBAL_UNSPECIFIED )
    #pragma section data .qines_mcal_adc_data
    #undef START_SECTION_DATAP_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_DATAP_GLOBAL_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_DATAP_GLOBAL_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_8 )
    #pragma section const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_8 )
    #pragma section
    #undef STOP_SECTION_RODATA_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_16 )
    #pragma section const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_16 )
    #pragma section
    #undef STOP_SECTION_RODATA_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_32 )
    #pragma section const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_UNSPECIFIED )
    #pragma section const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_RODATA_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_CONFIG_8 )
    #pragma section  const .qines_mcal_adc_config
    #undef START_SECTION_CONFIG_8
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_CONFIG_8 )
    #pragma section
    #undef STOP_SECTION_CONFIG_8
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_CONFIG_16 )
    #pragma section  const .qines_mcal_adc_config
    #undef START_SECTION_CONFIG_16
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_CONFIG_16 )
    #pragma section
    #undef STOP_SECTION_CONFIG_16
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_CONFIG_32 )
    #pragma section  const .qines_mcal_adc_config
    #undef START_SECTION_CONFIG_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_CONFIG_32 )
    #pragma section
    #undef STOP_SECTION_CONFIG_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_CONFIG_UNSPECIFIED )
    #pragma section  const .qines_mcal_adc_config
    #undef START_SECTION_CONFIG_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_CONFIG_UNSPECIFIED )
    #pragma section
    #undef STOP_SECTION_CONFIG_UNSPECIFIED
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_TEXT_LOCAL )
    #pragma section text .qines_mcal_adc_text
    #undef START_SECTION_TEXT_LOCAL
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_TEXT_LOCAL )
    #pragma section
    #undef STOP_SECTION_TEXT_LOCAL
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_TEXT_GLOBAL )
    #pragma section text .qines_mcal_adc_text
    #undef START_SECTION_TEXT_GLOBAL
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_TEXT_GLOBAL )
    #pragma section
    #undef STOP_SECTION_TEXT_GLOBAL
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_ZONE0_32 )
    #pragma section data .qines_mcal_adc_bss_zone0
    #undef START_SECTION_BSS_ZONE0_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_ZONE0_32 )
    #pragma section
    #undef STOP_SECTION_BSS_ZONE0_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_ZONE1_32 )
    #pragma section data .qines_mcal_adc_bss_zone1
    #undef START_SECTION_BSS_ZONE1_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_ZONE1_32 )
    #pragma section
    #pragma alignvar (4)
    #undef STOP_SECTION_BSS_ZONE1_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_ZONE2_32 )
    #pragma section data .qines_mcal_adc_bss_zone2
    #undef START_SECTION_BSS_ZONE2_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_ZONE2_32 )
    #pragma section
    #undef STOP_SECTION_BSS_ZONE2_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_ZONE3_32 )
    #pragma section bss .qines_mcal_adc_bss_zone3
    #undef START_SECTION_BSS_ZONE3_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_ZONE3_32 )
    #pragma section
    #undef STOP_SECTION_BSS_ZONE3_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_ZONE4_32 )
    #pragma section bss .qines_mcal_adc_bss_zone4
    #undef START_SECTION_BSS_ZONE4_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_ZONE4_32 )
    #pragma section
    #undef STOP_SECTION_BSS_ZONE4_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_ZONE5_32 )
    #pragma section bss .qines_mcal_adc_bss_zone5
    #undef START_SECTION_BSS_ZONE5_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_ZONE5_32 )
    #pragma section
    #undef STOP_SECTION_BSS_ZONE5_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_ZONE6_32 )
    #pragma section bss .qines_mcal_adc_bss_zone6
    #undef START_SECTION_BSS_ZONE6_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_ZONE6_32 )
    #pragma section
    #undef STOP_SECTION_BSS_ZONE6_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_BSS_ZONE7_32 )
    #pragma section bss .qines_mcal_adc_bss_zone7
    #undef START_SECTION_BSS_ZONE7_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_BSS_ZONE7_32 )
    #pragma section
    #undef STOP_SECTION_BSS_ZONE7_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_ZONE0_32 )
    #pragma section  const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_ZONE0_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_ZONE0_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_ZONE0_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_ZONE1_32 )
    #pragma section  const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_ZONE1_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_ZONE1_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_ZONE1_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_ZONE2_32 )
    #pragma section  const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_ZONE2_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_ZONE2_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_ZONE2_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_ZONE3_32 )
    #pragma section  const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_ZONE3_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_ZONE3_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_ZONE3_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_ZONE4_32 )
    #pragma section  const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_ZONE4_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_ZONE4_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_ZONE4_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_ZONE5_32 )
    #pragma section  const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_ZONE5_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_ZONE5_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_ZONE5_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_ZONE6_32 )
    #pragma section  const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_ZONE6_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_ZONE6_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_ZONE6_32
    #undef MEMMAP_ERROR
#elif defined( START_SECTION_RODATA_ZONE7_32 )
    #pragma section  const .qines_mcal_adc_const
    #undef START_SECTION_RODATA_ZONE7_32
    #undef MEMMAP_ERROR
#elif defined( STOP_SECTION_RODATA_ZONE7_32 )
    #pragma section
    #undef STOP_SECTION_RODATA_ZONE7_32
    #undef MEMMAP_ERROR
#endif

#if defined( MEMMAP_ERROR )
    #error "Lin_MemMap.h, Valid section-symbols are not found"
#endif

/* EOF Lin_MemMap.h **********************************************************/

